qmckl_probe(#+TITLE: Atomic Orbitals
#+SETUPFILE: ../tools/theme.setup
#+INCLUDE: ../tools/lib.org

The atomic basis set is defined as a list of shells. Each shell $s$ is
centered on a nucleus $A$, possesses a given angular momentum $l$ and a
radial function $R_s$. The radial function is a linear combination of
\emph{primitive} functions that can be of type Slater ($p=1$)  or
Gaussian ($p=2$):

\[
  R_s(\mathbf{r}) = \mathcal{N}_s |\mathbf{r}-\mathbf{R}_A|^{n_s}
  \sum_{k=1}^{N_{\text{prim}}} a_{ks}\, f_{ks}
 \exp \left( - \gamma_{ks} | \mathbf{r}-\mathbf{R}_A | ^p \right).
\]

In the case of Gaussian functions, $n_s$ is always zero.
The normalization factor $\mathcal{N}_s$ ensures that all the functions
of the shell are normalized to unity. Usually, basis sets are given
a combination of normalized primitives, so the normalization
coefficients of the primitives, $f_{ks}$, need also to be provided.

Atomic orbitals (AOs) are defined as

\[
\chi_i (\mathbf{r}) = \mathcal{M}_i\, P_{\eta(i)}(\mathbf{r})\, R_{\theta(i)} (\mathbf{r})
\]

where $\theta(i)$ returns the shell on which the AO is expanded,
and $\eta(i)$ denotes which angular function is chosen.
Here, the parameter $\mathcal{M}_i$ is an extra parameter which allows
the normalization of the different functions of the same shell to be
different, as in GAMESS for example.

In this section we describe first how the basis set is stored in the
context, and then we present the kernels used to compute the values,
gradients and Laplacian of the atomic basis functions.

*** Compute
   :PROPERTIES:
   :Name:     qmckl_compute_ao_basis_primitive_gaussian_vgl
   :CRetType: qmckl_exit_code
   :FRetType: qmckl_exit_code
   :END:

    #+NAME: qmckl_ao_basis_primitive_gaussian_vgl_args
   | qmckl_context | context                                        | in  | Global state                                     |
   | int64_t       | prim_num                                       | in  | Number of primitives                             |
   | int64_t       | elec_num                                       | in  | Number of electrons                              |
   | int64_t       | nucl_num                                       | in  | Number of nuclei                                 |
   | int64_t       | walk_num                                       | in  | Number of walkers                                |
   | int64_t       | nucleus_prim_index[nucl_num]                   | in  | Index of the 1st primitive of each nucleus       |
   | double        | elec_coord[walk_num][3][elec_num]              | in  | Electron coordinates                             |
   | double        | nucl_coord[3][elec_num]                        | in  | Nuclear coordinates                              |
   | double        | expo[prim_num]                                 | in  | Exponents of the primitives                      |
   | double        | primitive_vgl[prim_num][5][walk_num][elec_num] | out | Value, gradients and Laplacian of the primitives |

    #+begin_src f90 :comments org :tangle (eval f) :noweb yes
integer function qmckl_compute_ao_basis_primitive_gaussian_vgl_f(context, &
     prim_num, elec_num, nucl_num, walk_num, &
     nucleus_prim_index, elec_coord, nucl_coord, expo, primitive_vgl) &
     result(info)
  use qmckl
  implicit none
  integer(qmckl_context), intent(in)  :: context
  integer*8             , intent(in)  :: prim_num
  integer*8             , intent(in)  :: nucl_num
  integer*8             , intent(in)  :: elec_num
  integer*8             , intent(in)  :: walk_num
  integer*8             , intent(in)  :: nucleus_prim_index(nucl_num+1)
  double precision      , intent(in)  :: elec_coord(elec_num,3,walk_num)
  double precision      , intent(in)  :: nucl_coord(nucl_num,3)
  double precision      , intent(in)  :: expo(prim_num)
  double precision      , intent(out) :: primitive_vgl(elec_num,walk_num,5,prim_num)

  integer*8 :: inucl, iprim, iwalk, ielec
  double precision :: x, y, z, two_a, ar2, r2, v, cutoff

  info = QMCKL_SUCCESS

  ! Don't compute exponentials when the result will be almost zero.
  cutoff = -dlog(1.d-15)

  do inucl=1,nucl_num
     ! C is zero-based, so shift bounds by one
     do iprim = nucleus_prim_index(inucl)+1, nucleus_prim_index(inucl+1)
        do iwalk = 1, walk_num
           do ielec = 1, elec_num
              x = elec_coord(ielec,1,iwalk) - nucl_coord(inucl,1)
              y = elec_coord(ielec,2,iwalk) - nucl_coord(inucl,2)
              z = elec_coord(ielec,3,iwalk) - nucl_coord(inucl,3)

              r2 = x*x + y*y + z*z
              ar2 = expo(iprim)*r2
              if (ar2 > cutoff) cycle

              v = dexp(-ar2)
              two_a = -2.d0 * expo(iprim) * v

              primitive_vgl(ielec, iwalk, 1, iprim) = v
              primitive_vgl(ielec, iwalk, 2, iprim) = two_a * x
              primitive_vgl(ielec, iwalk, 3, iprim) = two_a * y
              primitive_vgl(ielec, iwalk, 4, iprim) = two_a * z
              primitive_vgl(ielec, iwalk, 5, iprim) = two_a * (3.d0 - 2.d0*ar2)

           end do
        end do
     end do
  end do

end function qmckl_compute_ao_basis_primitive_gaussian_vgl_f
    #+end_src

    #+begin_src c :tangle (eval h_private_func) :comments org :exports none
qmckl_exit_code qmckl_compute_ao_basis_primitive_gaussian_vgl(
          const qmckl_context context,
          const int64_t  prim_num,
          const int64_t  elec_num,
          const int64_t  nucl_num,
          const int64_t  walk_num,
          const int64_t* nucleus_prim_index,
          const double*  elec_coord,
          const double*  nucl_coord,
          const double*  expo,
          double* const primitive_vgl);
    #+end_src

    #+CALL: generate_c_interface(table=qmckl_ao_basis_primitive_gaussian_vgl_args,rettyp=get_value("CRetType"),fname="qmckl_compute_ao_basis_primitive_gaussian_vgl"))

    #+RESULTS:
    #+begin_src f90 :tangle (eval f) :comments org :exports none
    integer(c_int32_t) function qmckl_compute_ao_basis_primitive_gaussian_vgl &
        (context, prim_num, elec_num, nucl_num, walk_num, nucleus_prim_index, elec_coord, nucl_coord, expo, primitive_vgl) &
        bind(C) result(info)

      use, intrinsic :: iso_c_binding
      implicit none

      integer (c_int64_t) , intent(in)  , value :: context
      integer (c_int64_t) , intent(in)  , value :: prim_num
      integer (c_int64_t) , intent(in)  , value :: elec_num
      integer (c_int64_t) , intent(in)  , value :: nucl_num
      integer (c_int64_t) , intent(in)  , value :: walk_num
      integer (c_int64_t) , intent(in)          :: nucleus_prim_index(nucl_num)
      real    (c_double ) , intent(in)          :: elec_coord(elec_num,3,walk_num)
      real    (c_double ) , intent(in)          :: nucl_coord(elec_num,3)
      real    (c_double ) , intent(in)          :: expo(prim_num)
      real    (c_double ) , intent(out)         :: primitive_vgl(elec_num,walk_num,5,prim_num)

      integer(c_int32_t), external :: qmckl_compute_ao_basis_primitive_gaussian_vgl_f
      info = qmckl_compute_ao_basis_primitive_gaussian_vgl_f &
             (context, prim_num, elec_num, nucl_num, walk_num, nucleus_prim_index, elec_coord, nucl_coord, expo, primitive_vgl)

    end function qmckl_compute_ao_basis_primitive_gaussian_vgl
    #+end_src

    #+begin_src python :results output :exports none
import numpy as np

def f(a,x,y):
    return np.exp( -a*(np.linalg.norm(x-y))**2 )

def df(a,x,y,n):
    h0 = 1.e-6
    if   n == 1: h = np.array([h0,0.,0.])
    elif n == 2: h = np.array([0.,h0,0.])
    elif n == 3: h = np.array([0.,0.,h0])
    return ( f(a,x+h,y) - f(a,x-h,y) ) / (2.*h0)

def d2f(a,x,y,n):
    h0 = 1.e-6
    if   n == 1: h = np.array([h0,0.,0.])
    elif n == 2: h = np.array([0.,h0,0.])
    elif n == 3: h = np.array([0.,0.,h0])
    return ( f(a,x+h,y) - 2.*f(a,x,y) + f(a,x-h,y) ) / h0**2

def lf(a,x,y):
    return d2f(a,x,y,1) + d2f(a,x,y,2) + d2f(a,x,y,3)

elec_26_w1 = np.array( [  1.49050402641, 2.90106987953, -1.05920815468  ] )
elec_15_w2 = np.array( [  -2.20180344582,-1.9113150239,  2.2193744778600002 ] )
nucl_1    = np.array( [ 1.096243353458458e+00, 8.907054016973815e-01, 7.777092280258892e-01 ] )
nucl_2    = np.array( [ 1.168459237342663e+00, 1.125660720053393e+00, 2.833370314829343e+00 ] )

#double prim_vgl[prim_num][5][walk_num][elec_num];
a =  0.9059; x = elec_26_w1 ; y = nucl_1
print ( "[7][0][0][26] : %e"% f(a,x,y))
print ( "[7][1][0][26] : %e"% df(a,x,y,1))
print ( "[7][2][0][26] : %e"% df(a,x,y,2))
print ( "[7][3][0][26] : %e"% df(a,x,y,3))
print ( "[7][4][0][26] : %e"% lf(a,x,y))

a =  0.32578; x = elec_15_w2 ; y = nucl_2
print ( "[39][0][1][15] : %e"% f(a,x,y))
print ( "[39][1][1][15] : %e"% df(a,x,y,1))
print ( "[39][2][1][15] : %e"% df(a,x,y,2))
print ( "[39][3][1][15] : %e"% df(a,x,y,3))
print ( "[39][4][1][15] : %e"% lf(a,x,y))

    #+end_src

    #+RESULTS:
    #+begin_example
    [7][0][0][26] : 1.050157e-03
    [7][1][0][26] : -7.501497e-04
    [7][2][0][26] : -3.825069e-03
    [7][3][0][26] : 3.495056e-03
    [7][4][0][26] : 2.040013e-02
    [39][0][1][15] : 1.083038e-03
    [39][1][1][15] : 2.378275e-03
    [39][2][1][15] : 2.143086e-03
    [39][3][1][15] : 4.332750e-04
    [39][4][1][15] : 7.514605e-03
    #+end_example

*** Compute
   :PROPERTIES:
   :Name:     qmckl_compute_ao_basis_shell_gaussian_vgl
   :CRetType: qmckl_exit_code
   :FRetType: qmckl_exit_code
   :END:

    #+NAME: qmckl_ao_basis_shell_gaussian_vgl_args
   | ~qmckl_context~ | ~context~                                     | in  | Global state                                 |
   | ~int64_t~       | ~prim_num~                                    | in  | Number of primitives                         |
   | ~int64_t~       | ~shell_num~                                   | in  | Number of shells                             |
   | ~int64_t~       | ~elec_num~                                    | in  | Number of electrons                          |
   | ~int64_t~       | ~nucl_num~                                    | in  | Number of nuclei                             |
   | ~int64_t~       | ~walk_num~                                    | in  | Number of walkers                            |
   | ~int64_t~       | ~nucleus_shell_num[nucl_num]~                 | in  | Number of shells for each nucleus            |
   | ~int64_t~       | ~nucleus_index[nucl_num]~                     | in  | Index of the 1st shell of each nucleus       |
   | ~int64_t~       | ~shell_prim_index[shell_num]~                 | in  | Index of the 1st primitive of each shell     |
   | ~int64_t~       | ~shell_prim_num[shell_num]~                   | in  | Number of primitives per shell               |
   | ~double~        | ~elec_coord[walk_num][3][elec_num]~           | in  | Electron coordinates                         |
   | ~double~        | ~nucl_coord[3][elec_num]~                     | in  | Nuclear coordinates                          |
   | ~double~        | ~expo[prim_num]~                              | in  | Exponents of the primitives                  |
   | ~double~        | ~coef[prim_num]~                              | in  | Coefficients of the primitives               |
   | ~double~        | ~shell_vgl[shell_num][5][walk_num][elec_num]~ | out | Value, gradients and Laplacian of the shells |

    #+begin_src f90 :comments org :tangle (eval f) :noweb yes
integer function qmckl_compute_ao_basis_shell_gaussian_vgl_f(context, &
     prim_num, shell_num, elec_num, nucl_num, walk_num, &
     nucleus_shell_num, nucleus_index, shell_prim_index, shell_prim_num, &
     elec_coord, nucl_coord, expo, coef, shell_vgl) &
     result(info)
  use qmckl
  implicit none
  integer(qmckl_context), intent(in)  :: context
  integer*8             , intent(in)  :: prim_num
  integer*8             , intent(in)  :: shell_num
  integer*8             , intent(in)  :: nucl_num
  integer*8             , intent(in)  :: elec_num
  integer*8             , intent(in)  :: walk_num
  integer*8             , intent(in)  :: nucleus_shell_num(nucl_num)
  integer*8             , intent(in)  :: nucleus_index(nucl_num)
  integer*8             , intent(in)  :: shell_prim_index(shell_num)
  integer*8             , intent(in)  :: shell_prim_num(shell_num)
  double precision      , intent(in)  :: elec_coord(elec_num,3,walk_num)
  double precision      , intent(in)  :: nucl_coord(nucl_num,3)
  double precision      , intent(in)  :: expo(prim_num)
  double precision      , intent(in)  :: coef(prim_num)
  double precision      , intent(out) :: shell_vgl(elec_num,walk_num,5,shell_num)

  integer*8 :: inucl, iprim, iwalk, ielec, ishell
  double precision :: x, y, z, two_a, ar2, r2, v, cutoff

  info = QMCKL_SUCCESS

  ! Don't compute exponentials when the result will be almost zero.
  ! TODO : Use numerical precision here
  cutoff = -dlog(1.d-15)

  do inucl=1,nucl_num
     do ishell=nucleus_index(inucl)+1, nucleus_index(inucl)+nucleus_shell_num(inucl)
        ! C is zero-based, so shift bounds by one

        do iwalk = 1, walk_num
           do ielec = 1, elec_num

              shell_vgl(ielec, iwalk, 1:5, ishell) = 0.d0

              x = elec_coord(ielec,1,iwalk) - nucl_coord(inucl,1)
              y = elec_coord(ielec,2,iwalk) - nucl_coord(inucl,2)
              z = elec_coord(ielec,3,iwalk) - nucl_coord(inucl,3)

              r2 = x*x + y*y + z*z

              do iprim = shell_prim_index(ishell)+1, shell_prim_index(ishell)+shell_prim_num(ishell)

                 ar2 = expo(iprim)*r2
                 if (ar2 > cutoff) then
                    cycle
                 end if

                 v = coef(iprim) * dexp(-ar2)
                 two_a = -2.d0 * expo(iprim) * v

                 shell_vgl(ielec, iwalk, 1, ishell) = &
                      shell_vgl(ielec, iwalk, 1, ishell) + v

                 shell_vgl(ielec, iwalk, 2, ishell) = &
                      shell_vgl(ielec, iwalk, 2, ishell) + two_a * x

                 shell_vgl(ielec, iwalk, 3, ishell) = &
                      shell_vgl(ielec, iwalk, 3, ishell) + two_a * y

                 shell_vgl(ielec, iwalk, 4, ishell) = &
                      shell_vgl(ielec, iwalk, 4, ishell) + two_a * z

                 shell_vgl(ielec, iwalk, 5, ishell) = &
                      shell_vgl(ielec, iwalk, 5, ishell) + two_a * (3.d0 - 2.d0*ar2)

              end do

           end do
        end do

     end do
  end do

end function qmckl_compute_ao_basis_shell_gaussian_vgl_f
    #+end_src


    #+begin_src c :tangle (eval h_private_func) :comments org :exports none
qmckl_exit_code qmckl_compute_ao_basis_shell_gaussian_vgl(
          const qmckl_context context,
          const int64_t  prim_num,
          const int64_t  shell_num,
          const int64_t  elec_num,
          const int64_t  nucl_num,
          const int64_t  walk_num,
          const int64_t* nucleus_shell_num,
          const int64_t* shell_prim_index,
          const int64_t* nucleus_index,
          const int64_t* shell_prim_num,
          const double*  elec_coord,
          const double*  nucl_coord,
          const double*  expo,
          const double*  coef,
          double* const shell_vgl);
    #+end_src

    #+CALL: generate_c_interface(table=qmckl_ao_basis_shell_gaussian_vgl_args,rettyp=get_value("CRetType"),fname="qmckl_compute_ao_basis_shell_gaussian_vgl"))

    #+RESULTS:
    #+begin_src f90 :tangle (eval f) :comments org :exports none
    integer(c_int32_t) function qmckl_compute_ao_basis_shell_gaussian_vgl &
        (context, &
         prim_num, &
         shell_num, &
         elec_num, &
         nucl_num, &
         walk_num, &
         nucleus_shell_num, &
         nucleus_index, &
         shell_prim_index, &
         shell_prim_num, &
         elec_coord, &
         nucl_coord, &
         expo, &
         coef, &
         shell_vgl) &
        bind(C) result(info)

      use, intrinsic :: iso_c_binding
      implicit none

      integer (c_int64_t) , intent(in)  , value :: context
      integer (c_int64_t) , intent(in)  , value :: prim_num
      integer (c_int64_t) , intent(in)  , value :: shell_num
      integer (c_int64_t) , intent(in)  , value :: elec_num
      integer (c_int64_t) , intent(in)  , value :: nucl_num
      integer (c_int64_t) , intent(in)  , value :: walk_num
      integer (c_int64_t) , intent(in)          :: nucleus_shell_num(nucl_num)
      integer (c_int64_t) , intent(in)          :: nucleus_index(nucl_num)
      integer (c_int64_t) , intent(in)          :: shell_prim_index(shell_num)
      integer (c_int64_t) , intent(in)          :: shell_prim_num(shell_num)
      real    (c_double ) , intent(in)          :: elec_coord(elec_num,3,walk_num)
      real    (c_double ) , intent(in)          :: nucl_coord(elec_num,3)
      real    (c_double ) , intent(in)          :: expo(prim_num)
      real    (c_double ) , intent(in)          :: coef(prim_num)
      real    (c_double ) , intent(out)         :: shell_vgl(elec_num,walk_num,5,shell_num)

      integer(c_int32_t), external :: qmckl_compute_ao_basis_shell_gaussian_vgl_f
      info = qmckl_compute_ao_basis_shell_gaussian_vgl_f &
             (context, &
         prim_num, &
         shell_num, &
         elec_num, &
         nucl_num, &
         walk_num, &
         nucleus_shell_num, &
         nucleus_index, &
         shell_prim_index, &
         shell_prim_num, &
         elec_coord, &
         nucl_coord, &
         expo, &
         coef, &
         shell_vgl)

    end function qmckl_compute_ao_basis_shell_gaussian_vgl
    #+end_src

    #+begin_src python :results output :exports none
import numpy as np

def f(a,x,y):
    return np.sum( [c * np.exp( -b*(np.linalg.norm(x-y))**2) for b,c in a] )

def df(a,x,y,n):
    h0 = 1.e-6
    if   n == 1: h = np.array([h0,0.,0.])
    elif n == 2: h = np.array([0.,h0,0.])
    elif n == 3: h = np.array([0.,0.,h0])
    return ( f(a,x+h,y) - f(a,x-h,y) ) / (2.*h0)

def d2f(a,x,y,n):
    h0 = 1.e-6
    if   n == 1: h = np.array([h0,0.,0.])
    elif n == 2: h = np.array([0.,h0,0.])
    elif n == 3: h = np.array([0.,0.,h0])
    return ( f(a,x+h,y) - 2.*f(a,x,y) + f(a,x-h,y) ) / h0**2

def lf(a,x,y):
    return d2f(a,x,y,1) + d2f(a,x,y,2) + d2f(a,x,y,3)

elec_26_w1 = np.array( [  1.49050402641, 2.90106987953, -1.05920815468  ] )
elec_15_w2 = np.array( [  -2.20180344582,-1.9113150239,  2.2193744778600002 ] )
nucl_1    = np.array( [ 1.096243353458458e+00, 8.907054016973815e-01, 7.777092280258892e-01 ] )
nucl_2    = np.array( [ 1.168459237342663e+00, 1.125660720053393e+00, 2.833370314829343e+00 ] )

#double prim_vgl[prim_num][5][walk_num][elec_num];
x = elec_26_w1 ; y = nucl_1
a = [(  8.236000E+03,  -1.130000E-04  ),
     (  1.235000E+03,  -8.780000E-04  ),
     (  2.808000E+02,  -4.540000E-03  ),
     (  7.927000E+01,  -1.813300E-02  ),
     (  2.559000E+01,  -5.576000E-02  ),
     (  8.997000E+00,  -1.268950E-01  ),
     (  3.319000E+00,  -1.703520E-01  ),
     (  9.059000E-01,   1.403820E-01  ),
     (  3.643000E-01,   5.986840E-01  ),
     (  1.285000E-01,   3.953890E-01  )]

print ( "[1][0][0][26] : %e"% f(a,x,y))
print ( "[1][1][0][26] : %e"% df(a,x,y,1))
print ( "[1][2][0][26] : %e"% df(a,x,y,2))
print ( "[1][3][0][26] : %e"% df(a,x,y,3))
print ( "[1][4][0][26] : %e"% lf(a,x,y))

x = elec_15_w2 ; y = nucl_2
a = [(3.387000E+01, 6.068000E-03),
     (5.095000E+00, 4.530800E-02),
     (1.159000E+00, 2.028220E-01),
     (3.258000E-01, 5.039030E-01),
     (1.027000E-01, 3.834210E-01)]

print ( "[14][0][1][15] : %e"% f(a,x,y))
print ( "[14][1][1][15] : %e"% df(a,x,y,1))
print ( "[14][2][1][15] : %e"% df(a,x,y,2))
print ( "[14][3][1][15] : %e"% df(a,x,y,3))
print ( "[14][4][1][15] : %e"% lf(a,x,y))

    #+end_src

    #+RESULTS:
    #+begin_example
    [1][0][0][26] : 1.875569e-01
    [1][1][0][26] : -2.615250e-02
    [1][2][0][26] : -1.333535e-01
    [1][3][0][26] : 1.218483e-01
    [1][4][0][26] : 3.227973e-02
    [14][0][1][15] : 4.509748e-02
    [14][1][1][15] : 3.203918e-02
    [14][2][1][15] : 2.887081e-02
    [14][3][1][15] : 5.836910e-03
    [14][4][1][15] : 1.564721e-02
    #+end_example

** Compute file names
    #+begin_src emacs-lisp
; The following is required to compute the file names

(setq pwd (file-name-directory buffer-file-name))
(setq name (file-name-nondirectory (substring buffer-file-name 0 -4)))
(setq f  (concat pwd name "_f.f90"))
(setq fh (concat pwd name "_fh.f90"))
(setq c  (concat pwd name ".c"))
(setq h  (concat name ".h"))
(setq h_private  (concat name "_private.h"))
(setq c_test  (concat pwd "test_" name ".c"))
(setq f_test  (concat pwd "test_" name "_f.f90"))

; Minted
(require 'ox-latex)
(setq org-latex-listings 'minted)
(add-to-list 'org-latex-packages-alist '("" "listings"))
(add-to-list 'org-latex-packages-alist '("" "color"))

    #+end_src

    #+RESULTS:
    |   | color    |
    |   | listings |


# -*- mode: org -*-
# vim: syntax=c
